<?php
/**
 * Created by PhpStorm.
 * User: tongjin
 * Date: 2017/7/26
 * Time: 下午7:09
 */

/*
 * 算术运算符
 *
 * 1. +
 * 2. -
 * 3. *
 * 4. /
 * 5. %
 * 6. - 取反
 * 7. . 并置
 */

/*
 * 赋值运算符
 *
 * 1. =
 * 2. +=
 * 3. -=
 * 4. *=
 * 5. /=
 * 6. %=
 * 7. .=
 */

/*
 * 自增，自减运算符
 *
 * 1. ++
 * 2. --
 */

/*
 * 比较运算符
 *
 * 1. ==
 * 2. === 绝对等于
 * 3. !=
 * 4. <> 不等于
 * 5. !== 不绝对等于
 * 6. >
 * 7. <
 * 8. >=
 * 9. <=
 */

/*
 * 逻辑运算符
 *
 * 1. and
 * 2. or
 * 3. xor
 * 4. &&
 * 5. ||
 * 6. !
 */

/*
 * 数组运算符
 *
 * 1. +
 * 2. == 元素值相同
 * 3. === 元素值相同，顺序也相同
 * 4. !=
 * 5. <>
 * 6. !==
 *
 */

/*
 * 三元运算符
 *
 * a ? b : c
 */